[
  {
    "title": "প্রতিদিনের প্রয়োজনীয় দুআ",
    "icon": "weather-sunny",
    "duas": [
      {
        "id": "dua-after-waking-up",
        "arabic": "اَلْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
        "banglaPronunciation": "আলহামদু লিল্লাহিল্লাজি আহ্ইয়ান্দা বা'দা মা আমাতানা ওয়া ইলাইহিন নুশুর।",
        "banglaMeaning": "সকল প্রশংসা আল্লাহর জন্য, যিনি আমাদেরকে মৃত্যুর পর জীবন দান করেছেন এবং তাঁর দিকেই পুনরুত্থান।",
        "source": "বুখারী, মুসলিম"
      },
      {
        "id": "dua-before-eating",
        "arabic": "بِسْمِ اللَّهِ وَعَلَى بَرَكَةِ اللَّهِ",
        "banglaPronunciation": "বিসমিল্লাহি ওয়া আ'লা বারাকাতিল্লাহ।",
        "banglaMeaning": "আল্লাহর নামে এবং আল্লাহর বরকতের উপর (খাওয়া শুরু করছি)।",
        "source": "তিরমিযী"
      },
      {
        "id": "dua-after-eating",
        "arabic": "اَلْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
        "banglaPronunciation": "আলহামদু লিল্লাহিল্লাজি আত্ব’আমানা ওয়া সাকানা ওয়া জা'আলানা মুসলিমিন।",
        "banglaMeaning": "সকল প্রশংসা আল্লাহর জন্য, যিনি আমাদেরকে খাইয়েছেন ও পান করিয়েছেন এবং আমাদেরকে মুসলিম করেছেন।",
        "source": "আবু দাউদ, তিরমিযী"
      },
      {
        "id": "dua-before-entering-toilet",
        "arabic": "بِسْمِ اللَّهِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
        "banglaPronunciation": "বিসমিল্লাহ, আল্লাহুম্মা ইন্নি আ'উযু বিকা মিনাল খুবুসি ওয়াল খাবা'ইছ।",
        "banglaMeaning": "আল্লাহর নামে (প্রবেশ করছি)। হে আল্লাহ! আমি তোমার কাছে অপবিত্র জিন ও জিন্নি থেকে আশ্রয় প্রার্থনা করছি।",
        "source": "বুখারী, মুসলিম"
      },
      {
        "id": "dua-after-leaving-toilet",
        "arabic": "غُفْرَانَكَ",
        "banglaPronunciation": "গুফরানাকা।",
        "banglaMeaning": "আমি তোমার কাছে ক্ষমা চাই (হে আল্লাহ!)।",
        "source": "আবু দাউদ, তিরমিযী"
      },
      {
        "id": "dua-before-sleeping",
        "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
        "banglaPronunciation": "বিসমিকাল্লাহুম্মা আমুতু ওয়া আহ্ইয়া।",
        "banglaMeaning": "হে আল্লাহ! তোমার নামে আমি মৃত্যুবরণ করি এবং জীবিত থাকি।",
        "source": "বুখারী, মুসলিম"
      }
    ]
  },
  {
    "title": "সালাত সম্পর্কিত দুআ",
    "icon": "mosque",
    "duas": [
      {
        "id": "takbir-tahrima-dua-sana",
        "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرُكَ",
        "banglaPronunciation": "সুবহানাকাল্লাহুম্মা ওয়া বিহামদিকা ওয়া তাবারাকাসমুকা ওয়া তা'আলা জাদ্দুকা ওয়া লা ইলাহা গাইiruকা।",
        "banglaMeaning": "হে আল্লাহ! তুমি পবিত্র, তোমারই জন্য সমস্ত প্রশংসা। তোমার নাম বরকতময়, তোমার মর্যাদা অতি উঁচুতে এবং তুমি ছাড়া আর কোনো ইলাহ নেই।",
        "source": "মুসলিম, আবু দাউদ"
      },
      {
        "id": "ruku-tasbeeh",
        "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
        "banglaPronunciation": "সুবহানা রব্বিয়াল আযীম। (৩ বার)",
        "banglaMeaning": "আমার মহান প্রতিপালক সকল অপূর্ণতা থেকে পবিত্র।",
        "source": "মুসলিম, আবু দাউদ"
      },
      {
        "id": "sami-allahu-liman-hamidah",
        "arabic": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ",
        "banglaPronunciation": "সামি'আল্লাহু লিমান হামিদাহ।",
        "banglaMeaning": "আল্লাহ তার কথা শোনেন, যে তার প্রশংসা করে।",
        "source": "বুখারী, মুসলিম"
      },
      {
        "id": "rabbana-lakal-hamd",
        "arabic": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ",
        "banglaPronunciation": "রাব্বানা ওয়া লাকাল হামদ, হামদান কাসীরান ত্বাইয়্যিবান মুবারাকান ফীহি।",
        "banglaMeaning": "হে আমাদের প্রতিপালক! সমস্ত প্রশংসা তোমারই জন্য, এমন প্রশংসা যা অনেক, পবিত্র এবং বরকতময়।",
        "source": "বুখারী, মুসলিম"
      },
      {
        "id": "sujood-tasbeeh",
        "arabic": "سُبْحَانَ رَبِّيَ الْأَعْلَى",
        "banglaPronunciation": "সুবহানা রব্বিয়াল আ'লা। (৩ বার)",
        "banglaMeaning": "আমার সর্বোচ্চ প্রতিপালক সকল অপূর্ণতা থেকে পবিত্র।",
        "source": "মুসলিম, আবু দাউদ"
      },
      {
        "id": "dua-between-two-sajdah",
        "arabic": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
        "banglaPronunciation": "রাব্বিগফিরলি, রাব্বিগফিরলি।",
        "banglaMeaning": "হে আমার প্রতিপালক! আমাকে ক্ষমা করো, হে আমার প্রতিপালক! আমাকে ক্ষমা করো।",
        "source": "আবু দাউদ, নাসায়ী"
      },
      {
        "id": "tashahhud",
        "arabic": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
        "banglaPronunciation": "আত্তাহিইয়্যাতু লিল্লাহি ওয়াসসালাওয়াতু ওয়াত তাইয়্যিবাতু। আসসালামু আলাইকা আইয়্যুহান্নাবীয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু। আসসালামু আলাইনা ওয়া আলা ইবাদিল্লাহিস সালিহীন। আশহাদু আল লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।",
        "banglaMeaning": "সকল মৌখিক, শারীরিক ও আর্থিক ইবাদত আল্লাহর জন্য। হে নবী! আপনার উপর শান্তি, আল্লাহর রহমত ও বরকত বর্ষিত হোক। আমাদের উপর এবং আল্লাহর নেক বান্দাদের উপর শান্তি বর্ষিত হোক। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোনো ইলাহ নেই এবং আমি সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ তাঁর বান্দা ও রাসূল।",
        "source": "বুখারী, মুসলিম"
      },
      {
        "id": "durud-ibrahim",
        "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
        "banglaPronunciation": "আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিঁও ওয়া আলা আলি মুহাম্মাদিন কামা সাল্লাইতা আলা ইবরাহীমা ওয়া আলা আলি ইবরাহীমা ইন্নাকা হামীদুম মাজীদ। আল্লাহুম্মা বারিক আলা মুহাম্মাদিঁও ওয়া আলা আলি মুহাম্মাদিন কামা বারাকতা আলা ইবরাহীমা ওয়া আলা আলি ইবরাহীমা ইন্নাকা হামীdুম মাজীদ।",
        "banglaMeaning": "হে আল্লাহ! মুহাম্মাদ ও তাঁর বংশধরের উপর রহমত বর্ষণ করো, যেমন তুমি ইবরাহীম ও তাঁর বংশধরের উপর রহমত বর্ষণ করেছো। নিশ্চয়ই তুমি প্রশংসিত ও মহিমান্বিত। হে আল্লাহ! মুহাম্মাদ ও তাঁর বংশধরের উপর বরকত বর্ষণ করো, যেমন তুমি ইবরাহীম ও তাঁর বংশধরের উপর বরকত বর্ষণ করেছো। নিশ্চয়ই তুমি প্রশংসিত ও মহিমান্বিত।",
        "source": "বুখারী, মুসলিম"
      }
    ]
  },
  {
    "title": "বিশেষ দুআ ও আয়াত",
    "icon": "star-four-points-outline",
    "duas": [
      {
        "id": "ayatul-kursi",
        "arabic": "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
        "banglaPronunciation": "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়্যুল কাইয়্যুম। লা তা'খুজুহু সিনাতুও ওয়া লা নাওম। লাহু মা ফিসসামাওয়াতি ওয়ামা ফিল আরদ্বি। মান যাল্লাযী ইয়াশফা'উ ই'নদাহু ইল্লা বিইযনিহি। ইয়া'লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম। ওয়ালা ইউহীতূনা বিশাইয়িম মিন 'ইলমিহি ইল্লা বিমা শাআ। ওয়াসী'আ কুরসীয়্যুহুস সামাওয়াতি ওয়াল আরদ্বা। ওয়ালা ইয়াঊদুহু হিফযুহুমা। ওয়াহুয়াল আলিয়্যুল আ'যীম।",
        "banglaMeaning": "আল্লাহ, তিনি ছাড়া আর কোনো ইলাহ নেই। তিনি চিরঞ্জীব, সর্বসত্তার ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না, নিদ্রাও নয়। আসমান ও যমীনে যা কিছু আছে, সবই তাঁর। কে আছে তাঁর কাছে সুপারিশ করবে তাঁর অনুমতি ছাড়া? তাদের সামনে ও পেছনে যা কিছু আছে, সবই তিনি জানেন। তাঁর জ্ঞানসীমা থেকে তারা কোনো কিছুকেই পরিবেষ্টিত করতে পারে না, তবে তিনি যা চান। তাঁর কুরসি আসমান ও যমীনকে পরিব্যাপ্ত করে আছে। আর সেগুলোর রক্ষণাবেক্ষণ তাঁকে ক্লান্ত করে না। তিনি সুউচ্চ, সুমহান।",
        "source": "সূরা আল-বাকারা, আয়াত: ২৫৫"
      },
      {
        "id": "dua-qunoot",
        "arabic": "اللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُثْنِي عَلَيْكَ الْخَيْرَ وَنَشْكُرُكَ وَلَا نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ اللَّهُمَّ إِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّي وَنَسْجُدُ وَإِلَيْكَ نَسْعَى وَنَحْفِدُ وَنَرْجُو رَحْمَتَكَ وَنَخْشَى عَذَابَكَ إِنَّ عَذَابَكَ بِالْكُفَّارِ مُلْحِقٌ",
        "banglaPronunciation": "আল্লাহুম্মা ইন্না নাসতাঈনুকা ওয়া নাসতাগফিরুকা ওয়া নুমিনু বিকা ওয়া নাতাওয়াক্কালু আলাইকা ওয়া নুছনি আলাইকাল খাইর, ওয়া নাশকুরুকা ওয়া লা নাকফুরুকা ওয়া নাখলাউ ওয়া নাতরuku মাই ইয়াফজুরুকা। আল্লাহুম্মা ইয়্যাকা না'বুদু ওয়া লাকা নুসল্লি ওয়া নাসজুদু ওয়া ইলাইকা নাস'আ ওয়া নাহফিদু ওয়া নারজু রাহমাতাকা ওয়া নাখশা আ'যাবাকা ইন্না আ'যাবাকা বিল কুফ্ফারি মুলহিক্ব।",
        "banglaMeaning": "হে আল্লাহ! আমরা তোমারই সাহায্য চাই, তোমারই কাছে ক্ষমা প্রার্থনা করি এবং তোমারই উপর ঈমান আনি, তোমারই উপর ভরসা করি এবং তোমার সকল উত্তম প্রশংসা করি। আমরা তোমার কৃতজ্ঞতা প্রকাশ করি এবং তোমার অকৃতজ্ঞতা করি না। আমরা তাকে পরিত্যাগ করি ও ছেড়ে দিই যে তোমার নাফরমানী করে। হে আল্লাহ! আমরা তোমারই ইবাদত করি, তোমারই জন্য সালাত আদায় করি ও সিজদা করি এবং তোমারই দিকে ধাবিত হই ও দ্রুত অগ্রসর হই। আমরা তোমার রহমতের প্রত্যাশা করি এবং তোমার আযাবকে ভয় করি। নিশ্চয়ই তোমার আযাব কাফিরদের উপর আপতিত হবে।",
        "source": "সুনানে আবু দাউদ"
      }
    ]
  },
  {
    "title": "নামাযের নিয়ত",
    "icon": "hand-pray",
    "duas": [
      {
        "id": "niyat-fajr-2-rakat-farz",
        "arabic": "نَوَيْتُ أَنْ أُصَلِّيَ لِلَّهِ تَعَالَى رَكْعَتَيْ صَلَاةِ الْفَجْرِ فَرْضُ اللَّهِ تَعَالَى مُتَوَجِّهًا إِلَى جِهَةِ الْكَعْبَةِ الشَّرِيفَةِ اللَّهُ أَكْبَرُ",
        "banglaPronunciation": "নাওয়াইতু আন উসাল্লিয়া লিল্লাহি তা'আলা রিক'আতাই সালাতিল ফাজরি ফারদুল্লাহি তা'আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা'বাতিল শারীফাতি আল্লাহু আকবার।",
        "banglaMeaning": "আমি আল্লাহর উদ্দেশ্যে ক্বিবলামুখী হয়ে দুই রাকাত ফজরের ফরয নামায আদায় করার নিয়ত করছি, আল্লাহু আকবার।",
        "source": "স্ব-উদ্ভাবিত (বিশেষ নিয়ত নয়, এটি কেবল নিয়তের সাধারণ কাঠামো)"
      },
      {
        "id": "niyat-zuhr-4-rakat-farz",
        "arabic": "نَوَيْتُ أَنْ أُصَلِّيَ لِلَّهِ تَعَالَى أَرْبَعَ رَكْعَاتِ صَلَاةِ الظُّهْرِ فَرْضُ اللَّهِ تَعَالَى مُتَوَجِّهًا إِلَى جِهَةِ الْكَعْبَةِ الشَّرِيفَةِ اللَّهُ أَكْبَرُ",
        "banglaPronunciation": "নাওয়াইতু আন উসাল্লিয়া লিল্লাহি তা'আলা আরবা'আ রিক'আতিল সালাতিয যুহরি ফারদুল্লাহি তা'আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা'বাতিল শারীফাতি আল্লাহু আকবার।",
        "banglaMeaning": "আমি আল্লাহর উদ্দেশ্যে ক্বিবলামুখী হয়ে চার রাকাত যোহরের ফরয নামায আদায় করার নিয়ত করছি, আল্লাহু আকবার।",
        "source": "স্ব-উদ্ভাবিত (বিশেষ নিয়ত নয়, এটি কেবল নিয়তের সাধারণ কাঠামো)"
      },
      {
        "id": "niyat-asr-4-rakat-farz",
        "arabic": "نَوَيْتُ أَنْ أُصَلِّيَ لِلَّهِ تَعَالَى أَرْبَعَ رَكْعَاتِ صَلَاةِ الْعَصْرِ فَرْضُ اللَّهِ تَعَالَى مُتَوَجِّهًا إِلَى جِهَةِ الْكَعْبَةِ الشَّرِيفَةِ اللَّهُ أَكْبَرُ",
        "banglaPronunciation": "নাওয়াইতু আন উসাল্লিয়া লিল্লাহি তা'আলা আরবা'আ রিক'আতিল সালাতিল আ'সরি ফারদুল্লাহি তা'আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা'বাতিল শারীফাতি আল্লাহু আকবার।",
        "banglaMeaning": "আমি আল্লাহর উদ্দেশ্যে ক্বিবলামুখী হয়ে চার রাকাত আসরের ফরয নামায আদায় করার নিয়ত করছি, আল্লাহু আকবার।",
        "source": "স্ব-উদ্ভাবিত (বিশেষ নিয়ত নয়, এটি কেবল নিয়তের সাধারণ কাঠামো)"
      },
      {
        "id": "niyat-maghrib-3-rakat-farz",
        "arabic": "نَوَيْتُ أَنْ أُصَلِّيَ لِلَّهِ تَعَالَى ثَلَاثَ رَكْعَاتِ صَلَاةِ الْمَغْرِبِ فَرْضُ اللَّهِ تَعَالَى مُتَوَجِّهًا إِلَى جِهَةِ الْكَعْبَةِ الشَّرِيفَةِ اللَّهُ أَكْبَرُ",
        "banglaPronunciation": "নাওয়াইতু আন উসাল্লিয়া লিল্লাহি তা'আলা ছালাছা রিক'আতিল সালাতিল মাগরিবী ফারদুল্লাহি তা'আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা'বাতিল শারীফাতি আল্লাহু আকবার।",
        "banglaMeaning": "আমি আল্লাহর উদ্দেশ্যে ক্বিবলামুখী হয়ে তিন রাকাত মাগরিবের ফরয নামায আদায় করার নিয়ত করছি, আল্লাহু আকবার।",
        "source": "স্ব-উদ্ভাবিত (বিশেষ নিয়ত নয়, এটি কেবল নিয়তের সাধারণ কাঠামো)"
      },
      {
        "id": "niyat-isha-4-rakat-farz",
        "arabic": "نَوَيْتُ أَنْ أُصَلِّيَ لِلَّهِ تَعَالَى أَرْبَعَ رَكْعَاتِ صَلَاةِ الْعِشَاءِ فَرْضُ اللَّهِ تَعَالَى مُتَوَجِّهًا إِلَى جِهَةِ الْكَعْبَةِ الشَّرِيفَةِ اللَّهُ أَكْبَرُ",
        "banglaPronunciation": "নাওয়াইতু আন উসাল্লিয়া লিল্লাহি তা'আলা আরবা'আ রিক'আতিল সালাতিল ই'শাই ফারদুল্লাহি তা'আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা'বাতিল শারীফাতি আল্লাহু আকবার।",
        "banglaMeaning": "আমি আল্লাহর উদ্দেশ্যে ক্বিবলামুখী হয়ে চার রাকাত ইশার ফরয নামায আদায় করার নিয়ত করছি, আল্লাহু আকবার।",
        "source": "স্ব-উদ্ভাবিত (বিশেষ নিয়ত নয়, এটি কেবল নিয়তের সাধারণ কাঠামো)"
      }
    ]
  }
]
